# DataFrame에서 데이터추출 -----------------------------------

- 열(컬럼 column 세로벡터) 단위 데이터 추출
    - 방식 : DF객체변수명[컬럼명] 또는 DF객체변수명.컬럼명

- 행(로우 row 가로벡터) 단위 데이터 추출
    - 방식 : DF객체변수명.loc[인덱스라벨] 또는 DF객체변수명.iloc[정수인덱스]

- 원소 단위 데이터 추출
    - 방식 : DF객체변수명.loc[행인덱스라벨, 열인덱스라벨] 또는 [행인덱스라벨][열인덱스라벨]
    -        DF객체변수명.iloc[행인덱스, 열인덱스] 또는 [행인덱스][열인덱스]

In [28]:
# 모듈 로딩 -------------------
import pandas as pd

# DF객체 생성 -----------------
df=pd.DataFrame([[1, 2, 3], [11, 22, 33]])

# DF객체 요약 정보 출력 메서드
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
dtypes: int64(3)
memory usage: 176.0 bytes

In [29]:
# DF객체 구성 확인
df

    0   1   2
0   1   2   3
1  11  22  33

In [30]:
# 열(세로) 데이터 추출 ----------------------
# DF객체변수명[컬럼명]
oneCol=df[0]

print(f'oneCol => \n{oneCol}\n', f'oneCol Type => \n{type(oneCol)}', sep='\n')

oneCol =>
0     1
1    11
Name: 0, dtype: int64

oneCol Type =>
<class 'pandas.core.series.Series'>

In [31]:
twoCol=df[[0, 2]]
print(f'twoCol => \n{twoCol}\n', f'twoCol Type => \n{type(twoCol)}', sep='\n')

twoCol =>
    0   2
0   1   3
1  11  33

twoCol Type =>
<class 'pandas.core.frame.DataFrame'>

In [32]:
twoCol=df[0:2]
print(f'twoCol => \n{twoCol}\n', f'twoCol Type => \n{type(twoCol)}', sep='\n')

twoCol =>
    0   1   2
0   1   2   3
1  11  22  33

twoCol Type =>
<class 'pandas.core.frame.DataFrame'>

In [33]:
# DF객체의 columns 속성 변경
df.columns=['one', 'two', 'three']
df

   one  two  three
0    1    2      3
1   11   22     33

In [34]:
#twoCol=df['one':'three']  # 얘는 안됨
print(f'twoCol => \n{twoCol}\n', f'twoCol Type => \n{type(twoCol)}', sep='\n')

twoCol =>
    0   1   2
0   1   2   3
1  11  22  33

twoCol Type =>
<class 'pandas.core.frame.DataFrame'>

# 행(row, 가로) 데이터 추출 ------------------------

- DF객체변수명.loc[], iloc[]

In [35]:
# DF객체 데이터 확인
df

   one  two  three
0    1    2      3
1   11   22     33

In [36]:
# 11, 22, 33 라인 전체 추출
oneRow=df.iloc[1]
print(f'oneRow => \n{oneRow}\n', f'oneRow Type => \n{type(oneRow)}', sep='\n')

oneRow =>
one      11
two      22
three    33
Name: 1, dtype: int64

oneRow Type =>
<class 'pandas.core.series.Series'>

In [37]:
oneRow=df.loc[1]
oneRow

one      11
two      22
three    33
Name: 1, dtype: int64

In [38]:
twoRow=df.iloc[[0, 1]]
twoRow

   one  two  three
0    1    2      3
1   11   22     33

In [86]:
exam_data={'수학':[90, 80, 70], '영어':[98, 89, 10], '음악':[85, 95, 100], '체육':[100, 90, 90]}
df=pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  10  100   90

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 서준 to 인아
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 120.0+ bytes

In [88]:
# 우현 학생의 성적만 추출
oneRow=df.loc['우현']
oneRow

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [89]:
# 인아 학생의 성적만 추출
print(df.loc['인아'])
# 또는
print(df.iloc[2])

수학     70
영어     10
음악    100
체육     90
Name: 인아, dtype: int64
수학     70
영어     10
음악    100
체육     90
Name: 인아, dtype: int64

In [62]:
# 음악 과목의 성적만 추출
oneCol=df['음악']
# 또는
oneCol=df.음악
oneCol

서준     85
우현     95
인아    100
Name: 음악, dtype: int64

In [90]:
# 우현 학생의 음악 점수
#df['음악']['우현']
# DF에서 원소 추출 => iloc[행번호, 열번호] 또는 loc[행라벨, 열라벨]
woo=df.loc['우현', '음악']   # 혹은 woo=df.loc['우현']['음악']
print(f'woo => {woo}',f'woo type=> {type(woo)}', sep='\n')

woo => 95
woo type=> <class 'numpy.int64'>

In [91]:
woo=df.iloc[1, 2] # 하면 위에 거랑 똑같이 나옴

In [92]:
select=df['수학'][2]   # 얘는 column 뽑은거임

oneCol=df['수학']
oneCol[2]    # 랑 똑같음

70

# DF에 행과 열 추가하기

- 행 추가 => DF객체변수명.loc[행라벨] = 데이터

- 열 추가 => DF객체변수명[컬럼] = 데이터

In [93]:
# 데이터 확인
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  10  100   90

In [94]:
# 행(row) 추가하기
df.loc['혜진']=[100, 100, 100, 100]
df

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   10  100   90
혜진  100  100  100  100

In [95]:
# df.loc['나령']=[100, 100]    # 오류남
# df

df.loc['나령']=100  # 숫자 하나만 넣으면 다 똑같은 값이 들어감
df

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   10  100   90
혜진  100  100  100  100
나령  100  100  100  100

In [96]:
df.loc['나령']=2000
df

      수학    영어    음악    체육
서준    90    98    85   100
우현    80    89    95    90
인아    70    10   100    90
혜진   100   100   100   100
나령  2000  2000  2000  2000

In [97]:
# 열(column) 추가하기
df['국어']=[100, 100, 100, 100, 100]
df

      수학    영어    음악    체육   국어
서준    90    98    85   100  100
우현    80    89    95    90  100
인아    70    10   100    90  100
혜진   100   100   100   100  100
나령  2000  2000  2000  2000  100

In [98]:
df['국어']=[0, 0, 0, 0, 1]   # 이미 있는데 똑같은거 넣으면 값이 바뀜
df

      수학    영어    음악    체육  국어
서준    90    98    85   100   0
우현    80    89    95    90   0
인아    70    10   100    90   0
혜진   100   100   100   100   0
나령  2000  2000  2000  2000   1

# DF에서 행과 열 삭제하기

- 삭제 관련 메서드 => drop()
    - 행 삭제 : DF객체변수명.drop(행, axis=0)  <- axis=0이 기본값
    - 열 삭제 : DF객체변수명.drop(열, axis=1)
    
- drop() 특징
    - 실제 데이터 삭제하지 않음 => 복사본에서 데이터 삭제하고 복사본 반환
    - 실제 데이터 삭제하기 => inplace=True

In [78]:
df

      수학    영어    음악    체육    국어
서준    90    98    85   100     0
우현    80    89    95    90     0
인아    70    10   100    90     0
혜진   100   100   100   100     0
나령  2000  2000  2000  2000  2000

In [99]:
# 인아 학생 성적 제거 => 행(row)
df3=df.drop('인아')

In [100]:
df3

      수학    영어    음악    체육  국어
서준    90    98    85   100   0
우현    80    89    95    90   0
혜진   100   100   100   100   0
나령  2000  2000  2000  2000   1

In [107]:
df

      수학    영어    음악    체육  국어
우현    80    89    95    90   0
인아    70    10   100    90   0
혜진   100   100   100   100   0
나령  2000  2000  2000  2000   1

In [103]:
df4=df.drop('서준', inplace=True)

KeyError: "['서준'] not found in axis"

In [106]:
print(df4)

None

In [112]:
# 열 삭제 => 수학 컬럼
# => DF객체변수명.drop(열, axis=1, inplace=True)
df5=df.drop('수학', axis=1)
df5

      영어    음악    체육  국어
우현    89    95    90   0
인아    10   100    90   0
혜진   100   100   100   0
나령  2000  2000  2000   1

In [113]:
df

      수학    영어    음악    체육  국어
우현    80    89    95    90   0
인아    70    10   100    90   0
혜진   100   100   100   100   0
나령  2000  2000  2000  2000   1

# 행 & 열 전환

- 행 ==> 열, 열 ==> 행으로 변환

- 방법
    - 메서드 : DF객체변수명.transpose()
    - 속성 : DF객체변수명.T

In [116]:
df

      수학    영어    음악    체육  국어
우현    80    89    95    90   0
인아    70    10   100    90   0
혜진   100   100   100   100   0
나령  2000  2000  2000  2000   1

In [117]:
# DF 객체의 형태 => shape 속성
df.shape

(4, 5)

In [118]:
# 행 <-> 열 전환
df.T

    우현   인아   혜진    나령
수학  80   70  100  2000
영어  89   10  100  2000
음악  95  100  100  2000
체육  90   90  100  2000
국어   0    0    0     1

In [119]:
df.shape

(4, 5)

In [121]:
df.transpose()  # 여기는 inplace 없음

    우현   인아   혜진    나령
수학  80   70  100  2000
영어  89   10  100  2000
음악  95  100  100  2000
체육  90   90  100  2000
국어   0    0    0     1

In [123]:
df=df.transpose()
df.shape

(4, 5)